/*
题目背景
本题为提交答案题，您可以写程序或手算在本机上算出答案后，直接提交答案文本，也可提交答案生成程序。

题目描述
将1，2，…，9共9个数分成三组，分别组成三个三位数，且使这三个三位数构成1:2:3的比例，试求出所有满足条件的三个三位数。

输入输出格式
输入格式：
无输入

输出格式：
若干行，每行3个数字。按照每行第一个数字升序排列。
*/

#include<stdio.h>
#include<stdlib.h>

int main(void){
  int n[10],i;
  int a1,a2,a3,a,b,c;

  for(i=1;i<=9;i++) n[i]=1; //若i可用则n[i]=1，否则n[i]=0
  for(a1=1;a1<=3;a1++){ //a1,a2,a3: a的三位
    n[a1]=0;
    for(a2=1;a2<=9;a2++) if(n[a2]){
      n[a2]=0;
      for(a3=1;a3<=9;a3++) if(n[a3]){
        n[a3]=0;
        a=a1*100+a2*10+a3;
        b=a*2; c=a*3;
        if(c<1000){
          n[b%10]=0; n[(b/10)%10]=0; n[b/100]=0;
          n[c%10]=0; n[(c/10)%10]=0; n[c/100]=0;
        }else continue;
        for(i=1;i<=9;i++) if(n[i]!=0) break;  //看是否1:9都用过了
        if(i==10) printf("%d %d %d\n",a,b,c);
        for(i=1;i<=9;i++) n[i]=1;
        n[a2]=0; n[a1]=0; //<b> </b>
      }
      n[a2]=1;
    }
    n[a1]=1;
  }

  return 0;
}
